# Задание 1

*Представьте, что вы работаете над разработкой простого приложения для записной книжки, которое позволяет пользователям добавлять, редактировать и удалять контакты.
Ваша задача - придумать как можно больше различных тестов (юнит-тесты, интеграционные тесты, сквозные тесты) для этого приложения. Напишите название каждого теста, его тип и краткое описание того, что этот тест проверяет.*

## Unit-тесты
addContaktTest() - проверка добавления контакта в список
changeContaktTest() - проверка редактирования контакта, который есть в списке
deleteContaktTest() - проверка удаления контакта из списка

## Интеграционный тест
fullContaktListTest() - создание списка контактов, в котором будут добавлены несколько контактов. Затем один из них будет изменен, а другой - удален.

## Сквозной тест
SereniumContaktTest() - в нем будут проверяться front-end компоненты (кнопки - их функционал и оформление) и их взаимодействие с методами классов.

# Задание 2

*Ниже список тестовых сценариев. Ваша задача - определить тип каждого теста (юнит-тест, интеграционный тест, сквозной тест) и объяснить, почему вы так решили.
Проверка того, что функция addContact корректно добавляет новый контакт в список контактов"".
""Проверка того, что при добавлении контакта через пользовательский интерфейс, контакт корректно отображается в списке контактов"".
""Проверка полного цикла работы с контактом: создание контакта, его редактирование и последующее удаление"".*

1. addContact - это unit-тест т.к. проверяет выполнение одного компонента.
2. Проверяется работа компонента через пользовательский интерфеис. Ответ - сквозной тест.
3. Здесь производится проверка компонентов в бизнес-логике. это интеграционный тест.
